webhook-stress.yml
config:
  target: "https://aqueduct-dollop-gigabyte.ngrok-free.dev"
  phases:
    - name: "Warm up"
      duration: 3
      arrivalRate: 10
    - name: "Stress"
      duration: 5
      arrivalRate: 50
    - name: "Spike"
      duration: 2
      arrivalRate: 100
  plugins:
    # Enables statusCode assertions on every request.
    # Install if needed: npm install -D @artillery/plugin-expect
    expect: {}

# ── Webhook authentication notes ────────────────────────────────────────────
# Helipagos documentation states that webhook POST requests include an "apikey"
# header. The value must match HELIPAGOS_WEBHOOK_SECRET (the "Webhook" token
# provided by Helipagos — NOT the Bearer token used for outbound API calls).
#
# Relevant environment variables:
#   HELIPAGOS_WEBHOOK_SECRET         — expected secret value; if unset, validation is skipped
#   HELIPAGOS_WEBHOOK_SECRET_HEADER  — header name (default: apikey)
#   HELIPAGOS_WEBHOOK_SECRET_REQUIRED — when "true" (default), absent header is
#                                       acknowledged but not processed
#
# DO NOT commit real secrets. Export HELIPAGOS_WEBHOOK_SECRET before running:
#   HELIPAGOS_WEBHOOK_SECRET=<your-webhook-token> pnpm stress:webhook
#
# All scenarios below expect HTTP 200. The webhook endpoint always returns 200
# regardless of validation outcome — failures are acknowledged but not processed
# to prevent the provider from retrying indefinitely.

scenarios:
  # ── Existing concurrent load ───────────────────────────────────────────────

  - name: "PROCESADA - concurrencia mismo pago"
    weight: 30
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
            # Scenario A: valid apikey — processed by the application.
            # Artillery 2.x reads $processEnvironment from the shell environment.
            # Run with: HELIPAGOS_WEBHOOK_SECRET=<token> pnpm stress:webhook
            apikey: "{{ $processEnvironment.HELIPAGOS_WEBHOOK_SECRET }}"
          json:
            id_sp: 706153
            estado: "PROCESADA"
            referencia_externa: "patitos-de-hule"
            importe_abonado: "150000"
          expect:
            - statusCode: 200

  - name: "PROCESADA - duplicado"
    weight: 10
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
            apikey: "{{ $processEnvironment.HELIPAGOS_WEBHOOK_SECRET }}"
          json:
            id_sp: 706153
            estado: "PROCESADA"
            referencia_externa: "patitos-de-hule"
            importe_abonado: "150000"
          expect:
            - statusCode: 200

  - name: "id_sp desconocido"
    weight: 10
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
            apikey: "{{ $processEnvironment.HELIPAGOS_WEBHOOK_SECRET }}"
          json:
            id_sp: 999999
            estado: "PROCESADA"
            referencia_externa: "unknown"
          expect:
            - statusCode: 200

  - name: "estado desconocido"
    weight: 5
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
            apikey: "{{ $processEnvironment.HELIPAGOS_WEBHOOK_SECRET }}"
          json:
            id_sp: 706153
            estado: "ESTADO_INVALIDO"
            referencia_externa: "patitos-de-hule"
          expect:
            - statusCode: 200

  # ── apikey validation scenarios ────────────────────────────────────────────
  # The endpoint contract guarantees HTTP 200 in all three cases below.
  # Internal processing only occurs when the apikey is present and correct
  # (or when HELIPAGOS_WEBHOOK_SECRET_REQUIRED=false and the header is absent).

  - name: "Scenario A: apikey válido - webhook procesado normalmente"
    # Correct Helipagos Webhook token → validation passes → use case runs.
    # apikey value is read from HELIPAGOS_WEBHOOK_SECRET at runtime.
    weight: 20
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
            apikey: "{{ $processEnvironment.HELIPAGOS_WEBHOOK_SECRET }}"
          json:
            id_sp: 706153
            estado: "PROCESADA"
            referencia_externa: "patitos-de-hule"
            importe_abonado: "150000"
          expect:
            - statusCode: 200

  - name: "Scenario B: apikey inválido - webhook ignorado, siempre HTTP 200"
    # Wrong apikey value → controller returns early without calling the use case.
    # HTTP 200 is still returned to prevent the provider from retrying.
    weight: 15
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
            apikey: "invalid-secret"
          json:
            id_sp: 706153
            estado: "PROCESADA"
            referencia_externa: "patitos-de-hule"
            importe_abonado: "150000"
          expect:
            - statusCode: 200

  - name: "Scenario C: sin apikey - ignorado (HELIPAGOS_WEBHOOK_SECRET_REQUIRED=true)"
    # Header absent + HELIPAGOS_WEBHOOK_SECRET_REQUIRED=true (default) →
    # controller acknowledges with HTTP 200 but does not call the use case.
    weight: 10
    flow:
      - post:
          url: "/api/payments/webhook"
          headers:
            Content-Type: "application/json"
          json:
            id_sp: 706153
            estado: "PROCESADA"
            referencia_externa: "patitos-de-hule"
            importe_abonado: "150000"
          expect:
            - statusCode: 200